app/controllers/projects_controller.rb

  def index
    @project = Project.new
    @projects = Project.all
---
SELECT `projects`.* FROM `projects`

  def show
    @project = Project.find(params[:id])
    @tcs = @project.test_cases.all
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
SELECT `test_cases`.* FROM `test_cases` WHERE `test_cases`.`project_id` = 1

  def edit
    @project = Project.find(params[:id])
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1

  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save
---
INSERT INTO `projects` (`created_at`, `name`, `updated_at`) VALUES ('2013-06-19 17:41:37', 'first new one', '2013-06-19 17:41:37')

  def update
    @project = Project.find(params[:id])

    respond_to do |format|
      if @project.update_attributes(params[:project])
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
UPDATE `projects` SET `name` = 'uuu1', `updated_at` = '2013-09-07 04:04:08' WHERE `projects`.`id` = 1

  def destroy
    @project = Project.find(params[:id])
    @project.destroy
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 2 LIMIT 1
DELETE FROM `projects` WHERE `projects`.`id` = 2