app/controllers/steps_controller.rb

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
SELECT `test_cases`.* FROM `test_cases` WHERE `test_cases`.`id` = 1 LIMIT 1
---
  def new
    @step = Step.new
    @project = Project.find(params[:project_id])
    @tc = TestCase.find(params[:test_case_id])

SELECT `steps`.* FROM `steps` WHERE `steps`.`id` = 1 LIMIT 1
SELECT `test_cases`.* FROM `test_cases` WHERE `test_cases`.`id` = 1 LIMIT 1
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
---
  def edit
    @step = Step.find(params[:id])
    @tc = TestCase.find(params[:test_case_id])
    @project = Project.find(params[:project_id])

INSERT INTO `steps` (`created_at`, `description`, `place`, `status`, `test_case_id`, `updated_at`) VALUES ('2013-06-20 22:17:58', 'nnn\r\nnn', NULL, NULL, 1, '2013-06-20 22:17:58')
---
  def create
    @step = Step.new(params[:step])
    @step.test_case_id = params[:test_case_id].to_i

    respond_to do |format|
      if @step.save

SELECT `steps`.* FROM `steps` WHERE `steps`.`id` = 0 LIMIT 1
DELETE FROM `steps` WHERE `steps`.`id` = 3
---
  def destroy
    @step = Step.find(params[:id])
    @step.destroy