app/controllers/test_cases_controller.rb

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
SELECT `steps`.* FROM `steps` WHERE `steps`.`test_case_id` = 1
---
  def show
    @tc = TestCase.find(params[:id])
    @project = @tc.project
    @steps = @tc.steps.where("status != 'deleted'")