app/controllers/test_cases_controller.rb

  def index
    @tc = TestCase.all
---
SELECT `test_cases`.* FROM `test_cases`

  def show
    @tc = TestCase.find(params[:id])
---
SELECT `test_cases`.* FROM `test_cases` WHERE `test_cases`.`id` = 1 LIMIT 1

  def new
    @tc = TestCase.new
    @project = Project.find(params[:project_id])
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1

  def edit
    @tc = TestCase.find(params[:id])
---
SELECT `test_cases`.* FROM `test_cases` WHERE `test_cases`.`id` = 1 LIMIT 1

  def create
    @tc = TestCase.new(params[:test_case])
    @tc.project = Project.find(params[:project_id].to_i)

    respond_to do |format|
      if @tc.save!
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
INSERT INTO `test_cases` (`created_at`, `description`, `name`, `project_id`, `updated_at`) VALUES ('2013-06-19 17:49:41', 'special\r\ndescription', 'first case', NULL, '2013-06-19 17:49:41')

  def destroy
    @tc = TestCase.find(params[:id])
    @tc.destroy
---
SELECT `test_cases`.* FROM `test_cases` WHERE `test_cases`.`id` = 2 LIMIT 1
DELETE FROM `test_cases` WHERE `test_cases`.`id` = 2